app/Controllers/BookingController.php

SELECT *
FROM "fare"
---
     public function fare()
     {
        $model = new \App\Models\FareModel();
        $Model = model('FareModel');
        $data['detail']=$model->findAll();

INSERT INTO "transactionticket" ("firstname", "lastname", "transactionid") VALUES ('mahesh', 'Bembade', 'TCQ123LI@123')
---
    public function insertransactionTicket()
    {
        $data=[
            'firstname'=>$this->request->getVar('firstname'),
            'lastname'=>$this->request->getVar('lastname'),
            'transactionid'=>$this->request->getVar('transactionid')
             ];

          // dd($data);
           $model = new \App\Models\TransactionTicketModel();
           $Model = model('TransactionTicketModel');
           $model->insert($data);

SELECT *
FROM "transactionticket"
---
    public function getTransactionTicket()
    {
       $detail=" ";
       $model = new \App\Models\TransactionTicketModel();
       $Model = model('TransactionTicketModel');
       $data['detail']=$model->findAll();