app/Controllers/PassController.php

    public function getPass()
    {
       $model = new \App\Models\PassModel();
       $Model = model('PassModel');
       $data['detail']=$model->findAll();
---
SELECT *
FROM "pass"

    public function getTransactionPass()
    {
        $detail=" ";
       $model = new \App\Models\TransactionPassModel();
       $Model = model('TransactionPassModel');
       $data['detail']=$model->findAll();
---
SELECT *
FROM "transactionpass"

    public function printPass($id)
    {
      $model = new \App\Models\PassModel();
      $Model = model('PassModel');
      $data['detail']=$model->find($id);
---
SELECT *
FROM "pass"
WHERE "pass"."id" = '6'